# GS_EdSh_RunDialog

## Description
Runs an edit shader dialog layout.

```pascal
PROCEDURE GS_EdSh_RunDialog(
				VAR userHitOK      : BOOLEAN;
				VAR libraryDataPtr : BOOLEAN);
```

```python

def vs.GS_EdSh_RunDialog():
    return (userHitOK, libraryDataPtr)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|userHitOK|BOOLEAN||
|libraryDataPtr|BOOLEAN||

## Version
Availability: from Vectorworks 2014
## Category
* Textures